Simulations/Chapter Four/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object fvSchemes;
}

    ddtSchemes
    {
        default	backward;
    }

    gradSchemes
    {
        default Gauss linear;
    }

    divSchemes
	{
		default         none;
		div(phi,U)      Gauss LUST grad(U);
		div(phi,nuTilda) Gauss limitedLinear 0.1;
		div((nuEff*dev2(T(grad(U))))) Gauss linear;
		
		div(phi,tracer) Gauss limitedLinear01 1;
	}

    interpolationSchemes
    {
        default			linear;
    }

    laplacianSchemes
    {
        default         Gauss linear orthogonal;
    }

    snGradSchemes
    {
        default			orthogonal;
    }

	wallDist
    {
        method meshWave;
    }

    fluxRequired
    {
        default no;
        p ;
        Phi ;
    }

// ************************************************************************* //
